app/controllers/to_do_lists_controller.rb

  def index
    @lists = ToDoList.all
---
SELECT * FROM "to_do_lists"

  def create
    @todo_list = ToDoList.new(params[:to_do_list])

    if @todo_list.save
---
INSERT INTO "to_do_lists" ("name", "created_at", "updated_at") VALUES('Test', '2009-07-30 03:22:26', '2009-07-30 03:22:26')

  def show
    @todo_list = ToDoList.find(params[:id])
---
SELECT * FROM "to_do_lists" WHERE ("to_do_lists"."id" = 2)

  def edit
    @todo_list = ToDoList.find(params[:id])
---
SELECT * FROM "to_do_lists" WHERE ("to_do_lists"."id" = 2)